applications/test/reactions/TimeSplittingForMultipleCells/0/eps
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      eps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
3
(
    0.5
    0.3
    0.1
);


boundaryField
{

    "(inlet|outlet|fixedWalls)"
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
